{"meta":{"title":"Wu Kefei's Blog","subtitle":"Welcome!","description":"A blog of a student in Jinling High School International Department.","author":"Lucy Wu","url":"https://wukefeilucy.github.io","root":"/"},"pages":[{"title":"tags","date":"2020-12-21T13:09:27.575Z","updated":"2020-12-14T14:18:54.282Z","comments":false,"path":"tags/index.html","permalink":"https://wukefeilucy.github.io/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2020-12-21T13:09:27.576Z","updated":"2020-12-11T16:34:46.000Z","comments":false,"path":"categories/index.html","permalink":"https://wukefeilucy.github.io/categories/index.html","excerpt":"","text":""},{"title":"about me","date":"2020-12-08T06:43:15.000Z","updated":"2020-12-14T14:15:07.930Z","comments":true,"path":"about/index.html","permalink":"https://wukefeilucy.github.io/about/index.html","excerpt":"","text":""},{"title":"Repositories","date":"2020-12-21T13:09:27.575Z","updated":"2020-12-08T17:32:11.000Z","comments":false,"path":"repository/index.html","permalink":"https://wukefeilucy.github.io/repository/index.html","excerpt":"","text":""}],"posts":[{"title":"Justice-second article","slug":"Justice-second article","date":"2020-12-22T12:42:00.000Z","updated":"2020-12-22T12:43:07.994Z","comments":true,"path":"2020/12/22/Justice-second article/","link":"","permalink":"https://wukefeilucy.github.io/2020/12/22/Justice-second%20article/","excerpt":"","text":"Justice-second articleThe article records some of my thoughts after reading the second article in Justice: What’s the Right Thing to Do.Some of my ideas about the last article have changed since I read this one.There are three points to consider: welfare, freedom and virtue. WELFAREWelfare means not only the quality of life of an individual, nor is it just a subsidy given by the government, but the sum of all the good things in society. From this viewing point, it would be improper to raise the price of goods and services. Because of the disaster, social welfare would decrease to a certain level. In addition, many of the citizens in the United States are actually poorer than we imagined. If the rise in price leads to the death of people, how would that be calculated? It is now not only the problem of income of firms, but also a problem of people’s lives. We will find that in this case, government intervention is necessary, because when people die one after another, social welfare will decline correspondingly. FREEDOMFreedom means the free exchange in a market system. From the perspective of freedom, we can see one point: the market has its own regulatory capacity. When supply is limited to a certain amount, the price will rise and the demand will decrease accordingly. After a period of time, the market will also reach a relative balance, but the corresponding price of goods will be several times higher than before. In other words, in a free market, as long as some people are willing to provide goods and services and others are willing to buy them, no matter how high the price appears, it is reasonable from an economic point of view, although there is a market failure. Under such circumstances, it seems that the government should not issue laws to limit malicious price increases, because both sides have the will and reach a certain balance between them. The emergence of laws and regulations will lead to the imbalance between supply and demand, that is, limited supply cannot meet unlimited demand. VIRTUEVirtue means the definition of kind and evil in people’s hearts. If we simply consider virtue, then we will discover that the rise in price is totally unreasonable. Because the rise in prices shows that some people are taking advantage of people’s danger and taking advantage of disaster to become rich. If other people get the information, they may be filled with righteous indignation. In this condition, it seems necessary for the government to emerge. The law seems to be not only a restriction on increase in price, but also a definition of kind and evil for people. However, in the last century, this kind of action leads to the rampancy of the Nazi. Whether it is good is still worth considering. In conclusion, the three points have to be combined together to determine whether or not an event should take place.","categories":[{"name":"Justice","slug":"Justice","permalink":"https://wukefeilucy.github.io/categories/Justice/"}],"tags":[{"name":"Justice","slug":"Justice","permalink":"https://wukefeilucy.github.io/tags/Justice/"}]},{"title":"First Blog","slug":"First-Blog","date":"2020-12-08T13:24:40.000Z","updated":"2020-12-14T14:20:30.970Z","comments":true,"path":"2020/12/08/First-Blog/","link":"","permalink":"https://wukefeilucy.github.io/2020/12/08/First-Blog/","excerpt":"","text":"Justice-first articleThe article records the reaction of firms and normal citizens after a hurricane. Prices of products and services were increased to an unimaginable level. Here are some of my thoughts. Here the government is not considered for some reason. THE RISE OF PRICE IS A NORMAL CONDITION.After the disaster, the shortage of goods is more serious than before. As a result, although people have a large demand of goods and services, the supply cannot actually meet the need. In this case, a selection is needed to choose some of the customers. Increase of price then comes out as a solution.In fact, even without the disaster, the rise in price is happening every day. The disaster simply makes the process hundreds of times faster, since the merchants sell $2 ice bags for $10. STANDING IN FIRMS’ SHOESThe purpose of the firms is to earn profit, or they would not have existed anyway. They see a chance of making more money after the struck of hurricane, so they would like to try to make more profit. Increasing supply appears to be a mission impossible at that time, for instance, construction companies cannot have enough workers for all the repairing tasks. Increasing prices seems to be a convenient choice for firms to limit the order they receive and make sure they earn more at the same time. AS A NORMAL CITIZENThe citizens actually experienced the biggest loss in the disaster. They had their houses or flats broken, cars flooded and notes all wet. Most of them did not have so much to pay for those products they had had the ability to afford. Only those who have noticeable amount of savings can afford the modernization and other services. In fact, the increase in price can be quite unfair to poor people.","categories":[{"name":"Book","slug":"Book","permalink":"https://wukefeilucy.github.io/categories/Book/"}],"tags":[{"name":"books Justice","slug":"books-Justice","permalink":"https://wukefeilucy.github.io/tags/books-Justice/"}]},{"title":"Hello World","slug":"hello-world","date":"2020-12-06T17:25:15.853Z","updated":"2020-12-06T17:25:15.853Z","comments":true,"path":"2020/12/07/hello-world/","link":"","permalink":"https://wukefeilucy.github.io/2020/12/07/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[{"name":"Justice","slug":"Justice","permalink":"https://wukefeilucy.github.io/categories/Justice/"},{"name":"Book","slug":"Book","permalink":"https://wukefeilucy.github.io/categories/Book/"}],"tags":[{"name":"Justice","slug":"Justice","permalink":"https://wukefeilucy.github.io/tags/Justice/"},{"name":"books Justice","slug":"books-Justice","permalink":"https://wukefeilucy.github.io/tags/books-Justice/"}]}