{"meta":{"title":"Wu Kefei's Blog","subtitle":"Welcome!","description":"A blog of a student in Jinling High School International Department.","author":"Lucy Wu","url":"https://wukefeilucy.github.io","root":"/"},"pages":[{"title":"tags","date":"2020-12-21T13:09:27.575Z","updated":"2020-12-14T14:18:54.282Z","comments":false,"path":"tags/index.html","permalink":"https://wukefeilucy.github.io/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2020-12-21T13:09:27.576Z","updated":"2020-12-11T16:34:46.000Z","comments":false,"path":"categories/index.html","permalink":"https://wukefeilucy.github.io/categories/index.html","excerpt":"","text":""},{"title":"about me","date":"2020-12-08T06:43:15.000Z","updated":"2020-12-14T14:15:07.930Z","comments":true,"path":"about/index.html","permalink":"https://wukefeilucy.github.io/about/index.html","excerpt":"","text":""},{"title":"Repositories","date":"2020-12-21T13:09:27.575Z","updated":"2020-12-08T17:32:11.000Z","comments":false,"path":"repository/index.html","permalink":"https://wukefeilucy.github.io/repository/index.html","excerpt":"","text":""},{"title":"","date":"2020-12-22T12:50:45.252Z","updated":"2020-12-22T12:47:35.613Z","comments":true,"path":"blogmodule.html","permalink":"https://wukefeilucy.github.io/blogmodule.html","excerpt":"","text":""}],"posts":[{"title":"Artist interview:If you can still be like a child when you grow up","slug":"2021:2:7","date":"2021-02-06T16:00:00.000Z","updated":"2021-02-07T09:31:20.699Z","comments":true,"path":"2021/02/07/2021:2:7/","link":"","permalink":"https://wukefeilucy.github.io/2021/02/07/2021:2:7/","excerpt":"","text":"When I called artist Gao Xinrong, I could hear a sound of chewing crunchy snacks. Originally from Nanjing, capital of east China’s Jiangsu Province, the 25-year-old artist began to learn painting since five, but shelved the skill after going to her university. In the winter of 2018, in order to leave unhappiness behind, she started to paint again. “My paintings are all about making people forget their unhappiness and recall their sweet memories.” she concluded her art pieces. For the artist, sweets, snacks and happy childhood memories are the origin of her creativity. “I like eating all the time, especially when I have no idea, sweet and snacks will help me come up with ideas,” she said. Referring to subjects of her digital paintings, she showed me two pieces. One is a cake and another is a child. “I think my paintings are cute and childlike,” she said with a smile. “Memories of Childhood”, 2020. Courtesy of Gao Xinrong The first piece — titled “memories of childhood” — features a little girl who rides on a bicycle and laughs happily, featuring a little old-fashioned tone. The whole scene is based on her grandfather’s hometown with retro color and ancient charm, including many small details that carry her childhood memory such as colorful stickers and tin cans of biscuits. “South Korean retro cakes”, 2020, Courtesy of Gao Xinrong Another one — which she titled “South Korean retro cakes” — features two retro cakes with pigs and colorful cream toppings. She always wanted to taste authentic South Korean retro cakes which are very popular this year, but failed to find them in Nanjing. Hence, she decided to draw them. “Sweet things can cure me completely. When I’m unhappy and lack of inspirations, as long as I see this kind of cake, it will make me feel very happy.” In 2018, the artist set up her own art studio Xinwen Lianbo in the city. According to her, “Xin” and “Wen” come from her and her husband’s names, and “Lianbo” means “alliance, encouragement and companionship.” “If there is a chance in the future, I want to turn this studio into a painting salon, where you can relax, chat, draw, create handicrafts and enjoy afternoon tea,” Gao told me her expectation. “I hope you will meet your love here,” said Gao.“I hope people who have seen my paintings can have sweet childhood and live happily like children in the future.”","categories":[{"name":"study experience","slug":"study-experience","permalink":"https://wukefeilucy.github.io/categories/study-experience/"}],"tags":[{"name":"study experience","slug":"study-experience","permalink":"https://wukefeilucy.github.io/tags/study-experience/"}]},{"title":"Exercise of Passage Writing","slug":"2021:2:3","date":"2021-02-02T16:00:00.000Z","updated":"2021-02-03T11:41:11.367Z","comments":true,"path":"2021/02/03/2021:2:3/","link":"","permalink":"https://wukefeilucy.github.io/2021/02/03/2021:2:3/","excerpt":"","text":"I am Wu Kefei from Nanjing, China. My mother school is Jinling High School, which is also a Cambridge A-Level centre. When other people talk about me, the very first word they may talk about is reliable. My family members say that I am a little bit careless but quite reliable in major events. Actually, I sometimes make strange mistakes, for instance taking the subway in the wrong direction. But my classmates think I am more meticulous and can observe some details that are difficult to notice. In their opinions, I am an optimistic girl who likes cats, is gentle to others, and is sometimes silly. In general, my classmates have a relatively good impression of me. My community doesn’t think I’m very enthusiastic. But anyone who needs help can come to me and I will try my best to solve the problem. Of course, before I help others, I will do my job well. One thing I am very impressed and proud of is that I once won a medal for my school in the Dragon Boat Race in high school. At that time, I was chosen to train for the dragon boat team. But unfortunately, because I had had an injury two months before training, I had not taken part in physical exercise during that period, so it was difficult to play to the normal level. Later, I took part in training with one of my classmates (she is an athlete, so she has a lot of experience in improving her physical fitness). After two months of striving, we got good results in the Dragon Boat Race, ranking second. This experience not only told me the importance of persistence, but also told me to learn to improve with my friends. Maybe the race can change my life afterwards.","categories":[{"name":"passages","slug":"passages","permalink":"https://wukefeilucy.github.io/categories/passages/"}],"tags":[{"name":"passages","slug":"passages","permalink":"https://wukefeilucy.github.io/tags/passages/"}]},{"title":"Justice-Third article","slug":"2021:1:11","date":"2021-01-11T12:00:00.000Z","updated":"2021-01-12T10:33:09.786Z","comments":true,"path":"2021/01/11/2021:1:11/","link":"","permalink":"https://wukefeilucy.github.io/2021/01/11/2021:1:11/","excerpt":"","text":"Justice-third articleThe article records some of my thoughts after reading the third article in Justice: What’s the Right Thing To Do.Here are some new ideas about injuries and rewards to soldiers who took part in wars. SOME EXPLAINATIONSPurple Heart: A medal given to soldiers who are wonded or killed in a war.PTSD: Post-traumatic stress disorder. A mental injury caused by serious traumatic events. It is related to many sectors, including gender, age, social status, characteristics, violence, etc. It is extremely unpredictable. MY OPINIONSFirst of all, we need to know that the Purple Heart Medal is awarded to soldiers who have been injured or killed in the war. This is recorded in American law.Well, here we need to discuss whether mental illness is a kind of trauma. In fact, mental illness is caused by external stimuli (which often cause great damage to people’s cognition) and some thoughts in people’s mind. If you are a soldier, you are sent to the battlefield in Iraq. It’s exciting to have real guns and ammunition there. However, it will not be long before you find out that the injuries caused by these guns and ammunition are also real. You cannot escape from the explosion, as well as shots, in a real battle field. One by one, your friends are knocked down by stray bullets and moan in front of you. The smoke of the explosion was mixed with the remains of the broken soldiers. The smell of scorch and blood almost made you spit out. You see, it is very painful just to imagine the scenes through the above words, not to mention those who have experienced these scenes themselves. Obviously, this has been able to cause mental disorders and even mental illness, and one of the most common is PTSD. However, some soldiers, especially those with multiple old wounds, will support another view.In their eyes, suffering from mental illness is not the enemy’s harm to you, but you can’t bear the pressure you have to bear as a soldier. They consider PTSD a sign of cowardice and insist that the purple heart should not be awarded to soldiers with mental illness.Their reason is that mental illness cannot be evaluated or measured, so whether it exists or not cannot be confirmed, so the certificate of awarding the Purple Heart Medal cannot be confirmed.This seems to make some sense. However, in fact, people with mental illness are tortured by it all their lives. For them, those horrible scenes are repeated again and again, and they may be trapped in the battlefield where they have been injured all their lives.It’s self-evident whether it’s trauma or not. The significance of my reading this article is not to judge whether the United States should award the Purple Heart Medal to soldiers suffering from mental illness. In fact, that is not something I can criticize or change alone. I did not give a definite answer. Maybe everyone has the value of judgment, and I cannot comment on it.","categories":[{"name":"Book","slug":"Book","permalink":"https://wukefeilucy.github.io/categories/Book/"}],"tags":[{"name":"books Justice","slug":"books-Justice","permalink":"https://wukefeilucy.github.io/tags/books-Justice/"}]},{"title":"Justice-second article","slug":"Justice-second article","date":"2020-12-22T12:42:00.000Z","updated":"2020-12-22T13:05:41.441Z","comments":true,"path":"2020/12/22/Justice-second article/","link":"","permalink":"https://wukefeilucy.github.io/2020/12/22/Justice-second%20article/","excerpt":"","text":"Justice-second articleThe article records some of my thoughts after reading the second article in Justice: What’s the Right Thing to Do.Some of my ideas about the last article have changed since I read this one.There are three points to consider: welfare, freedom and virtue. WELFAREWelfare means not only the quality of life of an individual, nor is it just a subsidy given by the government, but the sum of all the good things in society. From this viewing point, it would be improper to raise the price of goods and services. Because of the disaster, social welfare would decrease to a certain level. In addition, many of the citizens in the United States are actually poorer than we imagined. If the rise in price leads to the death of people, how would that be calculated? It is now not only the problem of income of firms, but also a problem of people’s lives. We will find that in this case, government intervention is necessary, because when people die one after another, social welfare will decline correspondingly. FREEDOMFreedom means the free exchange in a market system. From the perspective of freedom, we can see one point: the market has its own regulatory capacity. When supply is limited to a certain amount, the price will rise and the demand will decrease accordingly. After a period of time, the market will also reach a relative balance, but the corresponding price of goods will be several times higher than before. In other words, in a free market, as long as some people are willing to provide goods and services and others are willing to buy them, no matter how high the price appears, it is reasonable from an economic point of view, although there is a market failure. Under such circumstances, it seems that the government should not issue laws to limit malicious price increases, because both sides have the will and reach a certain balance between them. The emergence of laws and regulations will lead to the imbalance between supply and demand, that is, limited supply cannot meet unlimited demand. VIRTUEVirtue means the definition of kind and evil in people’s hearts. If we simply consider virtue, then we will discover that the rise in price is totally unreasonable. Because the rise in prices shows that some people are taking advantage of people’s danger and taking advantage of disaster to become rich. If other people get the information, they may be filled with righteous indignation. In this condition, it seems necessary for the government to emerge. The law seems to be not only a restriction on increase in price, but also a definition of kind and evil for people. However, in the last century, this kind of action leads to the rampancy of the Nazi. Whether it is good is still worth considering. In conclusion, the three points have to be combined together to determine whether or not an event should take place.","categories":[{"name":"Book","slug":"Book","permalink":"https://wukefeilucy.github.io/categories/Book/"}],"tags":[{"name":"books Justice","slug":"books-Justice","permalink":"https://wukefeilucy.github.io/tags/books-Justice/"}]},{"title":"First Blog","slug":"First-Blog","date":"2020-12-08T13:24:40.000Z","updated":"2020-12-14T14:20:30.970Z","comments":true,"path":"2020/12/08/First-Blog/","link":"","permalink":"https://wukefeilucy.github.io/2020/12/08/First-Blog/","excerpt":"","text":"Justice-first articleThe article records the reaction of firms and normal citizens after a hurricane. Prices of products and services were increased to an unimaginable level. Here are some of my thoughts. Here the government is not considered for some reason. THE RISE OF PRICE IS A NORMAL CONDITION.After the disaster, the shortage of goods is more serious than before. As a result, although people have a large demand of goods and services, the supply cannot actually meet the need. In this case, a selection is needed to choose some of the customers. Increase of price then comes out as a solution.In fact, even without the disaster, the rise in price is happening every day. The disaster simply makes the process hundreds of times faster, since the merchants sell $2 ice bags for $10. STANDING IN FIRMS’ SHOESThe purpose of the firms is to earn profit, or they would not have existed anyway. They see a chance of making more money after the struck of hurricane, so they would like to try to make more profit. Increasing supply appears to be a mission impossible at that time, for instance, construction companies cannot have enough workers for all the repairing tasks. Increasing prices seems to be a convenient choice for firms to limit the order they receive and make sure they earn more at the same time. AS A NORMAL CITIZENThe citizens actually experienced the biggest loss in the disaster. They had their houses or flats broken, cars flooded and notes all wet. Most of them did not have so much to pay for those products they had had the ability to afford. Only those who have noticeable amount of savings can afford the modernization and other services. In fact, the increase in price can be quite unfair to poor people.","categories":[{"name":"Book","slug":"Book","permalink":"https://wukefeilucy.github.io/categories/Book/"}],"tags":[{"name":"books Justice","slug":"books-Justice","permalink":"https://wukefeilucy.github.io/tags/books-Justice/"}]},{"title":"Hello World","slug":"hello-world","date":"2020-12-06T17:25:15.853Z","updated":"2020-12-06T17:25:15.853Z","comments":true,"path":"2020/12/07/hello-world/","link":"","permalink":"https://wukefeilucy.github.io/2020/12/07/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[{"name":"study experience","slug":"study-experience","permalink":"https://wukefeilucy.github.io/categories/study-experience/"},{"name":"passages","slug":"passages","permalink":"https://wukefeilucy.github.io/categories/passages/"},{"name":"Book","slug":"Book","permalink":"https://wukefeilucy.github.io/categories/Book/"}],"tags":[{"name":"study experience","slug":"study-experience","permalink":"https://wukefeilucy.github.io/tags/study-experience/"},{"name":"passages","slug":"passages","permalink":"https://wukefeilucy.github.io/tags/passages/"},{"name":"books Justice","slug":"books-Justice","permalink":"https://wukefeilucy.github.io/tags/books-Justice/"}]}